XMegaForArduino/arduino/variants/xmega32e5/pins_arduino.h
const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  // PORTLIST
  // -------------------------------------------
#ifndef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 0 ** 0 **
  _PD,  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  _PD,  // PD 2 ** 2 ** USARTD_RX
  _PD,  // PD 3 ** 3 ** USARTD_TX
#ifdef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 0 ** 2 **
#endif // DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 4 ** 4 **
  _PD,  // PD 5 ** 5 **
  _PD,  // PD 6 ** 6 **
  _PD,  // PD 7 ** 7 **
#ifdef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 1 ** 9 **
#else // no pin shifting
  _PC,  // PC 0 ** 8 ** SDA
  _PC,  // PC 1 ** 9 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  _PC,  // PC 2 ** 10 **
  _PC,  // PC 3 ** 11 **
  _PC,  // PC 4 ** 12 ** SPI_SS
// NOTE port doesn't change with DIGITAL_IO_PIN_SHIFT
  _PC,  // PC 5 ** 13 ** SPI_SCK
  _PC,  // PC 6 ** 14 ** SPI_MISO
  _PC,  // PC 7 ** 15 ** SPI_MOSI
  _PR,  // PR 0 ** 16 **
  _PR,  // PR 1 ** 17 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  _PC,  // PC 0 ** the new 16 ** SDA
  _PC,  // PC 1 ** the new 17 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
#ifndef USE_AREF
  _PA,  // PA 0 ** 18 ** A0
#endif // USE_AREF
  _PA,  // PA 1 ** 19 ** A1
  _PA,  // PA 2 ** 20 ** A2
  _PA,  // PA 3 ** 21 ** A3
  _PA,  // PA 4 ** 22 ** A4
  _PA,  // PA 5 ** 23 ** A5
  _PA,  // PA 6 ** 24 ** A6
  _PA,  // PA 7 ** 25 ** A7
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
  // PIN IN PORT
  // -------------------------------------------
#ifndef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PD 0 ** 0 **
  _BV( 1 ),  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  _BV( 2 ),  // PD 2 ** 2 ** USARTD_RX
  _BV( 3 ),  // PD 3 ** 3 ** USARTD_TX
#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PD 0 ** 2 **
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 4 ),  // PD 4 ** 4 **
  _BV( 5 ),  // PD 5 ** 5 **
  _BV( 6 ),  // PD 6 ** 6 **
  _BV( 7 ),  // PD 7 ** 7 **
#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 1 ),  // PD 1 ** 9 **
#else // no pin shifting
  _BV( 0 ),  // PC 0 ** 8 ** SDA
  _BV( 1 ),  // PC 1 ** 9 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 2 ),  // PC 2 ** 10 **
  _BV( 3 ),  // PC 3 ** 11 **
  _BV( 4 ),  // PC 4 ** 12 ** SPI_SS
#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 7 ),  // PC 7 ** 15 ** SPI_MOSI
#else // no pin shifting
  _BV( 5 ),  // PC 5 ** 13 ** SPI_SCK
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 6 ),  // PC 6 ** 14 ** SPI_MISO
#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 5 ),  // PC 5 ** 13 ** SPI_SCK
#else // no pin shifting
  _BV( 7 ),  // PC 7 ** 15 ** SPI_MOSI
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PR 0 ** 16 **
  _BV( 1 ),  // PR 1 ** 17 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PC 0 ** the new 16 ** SDA
  _BV( 1 ),  // PC 1 ** the new 17 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
#ifndef USE_AREF
  _BV( 0 ),  // PA 0 ** 18 ** A0
#endif // USE_AREF
  _BV( 1 ),  // PA 1 ** 19 ** A1
  _BV( 2 ),  // PA 2 ** 20 ** A2
  _BV( 3 ),  // PA 3 ** 21 ** A3
  _BV( 4 ),  // PA 4 ** 22 ** A4
  _BV( 5 ),  // PA 5 ** 23 ** A5
  _BV( 6 ),  // PA 6 ** 24 ** A6
  _BV( 7 ),  // PA 7 ** 25 ** A7
};




const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  // TIMERS
  // -------------------------------------------
  // The timers on the E5 are a bit different than the others
  // Since TIMERD5 only goes tp PD4, PD5, PD6, PD7, I have to
  // map them to places that have PWM.  Also, PD6 and PD7 don't
  // seem to work very well.  PC0 through PC3 work pretty well,
  // but PC0 and PC1 are TWI pins.  As such, the mapping won't
  // work very well if Arduino compatibility is desired.

#ifndef DIGITAL_IO_PIN_SHIFT
  NOT_ON_TIMER,  // PD 0 ** 0 **
  NOT_ON_TIMER,  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  NOT_ON_TIMER,  // PD 2 ** 2 ** USARTD_RX
  NOT_ON_TIMER,  // PD 3 ** 3 ** USARTD_TX
#ifdef DIGITAL_IO_PIN_SHIFT
  NOT_ON_TIMER,  // PD 0 ** 2 ** non-PWM 2
#endif // DIGITAL_IO_PIN_SHIFT
  TIMERD5,       // PD 4 ** 4 ** PWM 3
  TIMERD5,       // PD 5 ** 5 ** PWM 4
  NOT_ON_TIMER,  //TIMERD5,       // PD 6 ** 6 ** PWM 5
  NOT_ON_TIMER,  //TIMERD5,       // PD 7 ** 7 ** PWM 6
#ifdef DIGITAL_IO_PIN_SHIFT
  NOT_ON_TIMER,  // PD 1 ** 9 **
#else // no pin shifting
  TIMERC4,       // PC 0 ** 8 ** SDA
  TIMERC4,       // PC 1 ** 9 ** SCL
#endif // DIGITAL_IO_PIN_SHIFT
  TIMERC4,       // PC 2 ** 10 **
  TIMERC4,       // PC 3 ** 11 **
  NOT_ON_TIMER,  //TIMERC4,       // PC 4 ** 12 ** SPI_SS
// NOTE:  timer doesn't change with DIGITAL_IO_PIN_SHIFT
  NOT_ON_TIMER,  //TIMERC4,       // PC 5 ** 13 ** SPI_SCK
  NOT_ON_TIMER,  //TIMERC4,       // PC 6 ** 14 ** SPI_MISO
  NOT_ON_TIMER,  //TIMERC4,       // PC 7 ** 15 ** SPI_MOSI
// NOTE:  'not on timer' doesn't change with DIGITAL_IO_PIN_SHIFT
  NOT_ON_TIMER,  // PR 0 ** 16 **
  NOT_ON_TIMER,  // PR 1 ** 17 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  TIMERC4,       // PC 0 ** the new 16 **
  TIMERC4,       // PC 1 ** the new 17 **
#endif // DIGITAL_IO_PIN_SHIFT

#ifndef USE_AREF
  NOT_ON_TIMER,  // PA 0 ** 18 ** A0
#endif // USE_AREF
  NOT_ON_TIMER,  // PA 1 ** 19 ** A1
  NOT_ON_TIMER,  // PA 2 ** 20 ** A2
  NOT_ON_TIMER,  // PA 3 ** 21 ** A3
  NOT_ON_TIMER,  // PA 4 ** 22 ** A4
  NOT_ON_TIMER,  // PA 5 ** 23 ** A5
  NOT_ON_TIMER,  // PA 6 ** 24 ** A6
  NOT_ON_TIMER,  // PA 7 ** 25 ** A7
};

#endif


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial
#define SERIAL_HARDWARE_OPEN  Serial2

#endif


